
TEXTMain = {
    #Основное меню, когда человек еще не выбрал направление
 'main': "Привет\n\nБот для помощи в профориентации, найди: \nНа кого поступать?\nКуда поступать?\nГде подготовиться?\n\nТут постарались собрать самое важное🔥",
    #Основное меню, когда человек выбрал направление
 'mainwith': 'Ваше направление:\n{direction}\n\nНайди подходящие курсы в портале и реши куда поступать!'
}

TEXTvibor = {
    #Я знаю направление☑️-->
 'znayu': "Выберите уклон направления",
    #Я знаю направление☑️--> физмат
 'fizmat': 'Направления с физико-математическим уклоном',
    #Я знаю направление☑️--> гум
 'gym': 'Направления с гуманитарным уклоном',
     #Я знаю направление☑️--> химбио
 'himbio': 'Направления с химико-биологическим уклоном' 
}



Texttest = {
    #Я знаю направление☑️-->
 'starttest': "Мини-тест на 15 вопросов, которые помогут определить возможно вам симпотизирующие направления!",
    #vopros 1
 'vop1': '1 вопрос \n\nЧто вам интереснее всего?\na) Работать с техническими устройствами и системами\nb) Исследовать природу и растения\nc) Помогать людям справляться с психическими проблемами',
    #vopros 2
 'vop2': '2 вопрос \n\nКакой подход вам наиболее близок?\na) Анализ данных и принятие решений на основе цифр\nb) Исследование химических процессов и составов\nc) Помощь людям в поиске их внутреннего мира',
    #vopros 3
 'vop3': '3 вопрос \n\nЧто вам ближе?\na) Заниматься исследованиями в области экологии\nb) Разрабатывать и проектировать технологические системы\nc) Создавать и управлять маркетинговыми кампаниями',
    #vopros 4
 'vop4': '4 вопрос \n\nКакую работу вы предпочли бы?\na) Составлять стратегии для компании\nb) Работать с медицинскими или психологическими проблемами\nc) Работать с цифрами и вести учет',
    #vopros 5
 'vop5': '5 вопрос \n\nЧто вам нравится больше?\na) Работать в сфере науки и проводить эксперименты\nb) Разрабатывать новые IT-программы и технологии\nc) Помогать людям решать их юридические проблемы',
    #vopros 6
 'vop6': '6 вопрос \n\nКакой тип задач вам более интересен?\na) Анализировать финансовые данные\nb) Проводить научные эксперименты\nc) Работать с людьми в консультативной роли',
    #vopros 7
 'vop7': '7 вопрос \n\nКак вы представляете свою работу?\na) Создание новых технологий и инновационных решений\nb) Помощь в решении юридических вопросов\nc) Работа с природой и растениями',
    #vopros 8
 'vop8': '8 вопрос \n\nКакую из этих задач вы предпочли бы решать?\na) Прогнозировать экономические тенденции и финансовые потоки\nb) Оказывать поддержку людям с психическими расстройствами\nc) Работать с законодательством и правами людей',
    #vopros 9
 'vop9': '9 вопрос \n\nКакую роль в жизни вы хотите играть?\na) Научного исследователя\nb) Технического эксперта\nc) Продавца или маркетолога',
    #vopros 10
 'vop10': '10 вопрос \n\nКак вы видите свою работу в будущем?\na) Разрабатывать сложные проекты и системы\nb) Работать в финансовых институтах или банках\nc) Проводить консультации с клиентами',
    #vopros 11
 'vop11': '11 вопрос \n\nКакую проблему вам было бы интересно решать?\na) Управление проектами и бюджетами\nb) Создание маркетинговых стратегий\nc) Работа с растениями или химическими веществами',
    #vopros 12
 'vop12': '12 вопрос \n\nЧто вам кажется наиболее увлекательным?\na) Оказывать психологическую помощь\nb) Исследовать растения или химические вещества\nc) Разрабатывать новые технологии',
    #vopros 13
 'vop13': '13 вопрос \n\nКакие задачи вас привлекают больше всего?\na) Психологические консультации и терапия\nb) Работа с экономикой и финансами\nc) Консультирование по правовым вопросам',
    #vopros 14
 'vop14': '14 вопрос \n\nЧто вам нравится делать в свободное время?\na) Исследовать и разрабатывать новые технологии\nb) Разбираться в сложных финансовых ситуациях\nc) Участвовать в природоохранных проектах',
    #vopros 15
 'vop15': '15 вопрос \n\nКакую работу вы бы предпочли в кризисной ситуации?\na) Помогать людям справиться с трудностями психического здоровья\nb) Работать с природой и экологией\nc) Рекомендовать правовые решения в нестандартных ситуациях',
    #konec
 'konec': 'Вы завершили тест, ваш результат \n\nПредпологаем:\n{result1} или {result2}',
   
}


TEXTobzor_vyzov = {
    #Я знаю направление☑️-->
 'obzor_vstyplenie1': 'Выберите уклон направления для подбора соотвествующих вузов',
    #Я знаю направление☑️-->
 'obzor_vstyplenie2': "Выберите направление для подбора соотвествующих вузов",
    #Я знаю направление☑️--> физмат
 'invyztext': 'Список вузов, в которых можно обучиться на профессию  - {direction}',
    #Я знаю направление☑️--> гум
 'prohodnoy': 'Средний балл ЕГЭ в вузе\n\n\nСредний балл ЕГЭ в вузе определяется для всего вуза и является официальной статистикой, которую он сообщает в Минобрнауки для анализа качества приема.\n\nСредний балл ЕГЭ вуза — это минимальный средний балл одного ЕГЭ крайнего абитуриента, поступившего в вуз. Рассчитывается он так: сумма баллов ЕГЭ по экзаменам, которые необходимы для участия в конкурсе на программы вуза, деленная на количество экзаменов, которые должен сдать абитуриент.',
}
TEXTobzorall = {
    #Я знаю направление☑️-->
 'obzor_start': "Выберите уклон направления",
    #Я знаю направление☑️--> физмат
 'obzor_vstyplenie1': 'Направления с физико-математическим уклоном',
    #Я знаю направление☑️--> гум
 'obzor_vstyplenie2': 'Направления с гуманитарным уклоном',
     #Я знаю направление☑️--> химбио
 'obzor_vstyplenie3': 'Направления с химико-биологическим уклоном' 
}




TEXTdop = {
    #Я знаю направление☑️-->
 'dop_text': "▼Дополнительно▼"
}

